package org.dueam.hadoop.services;

import java.io.File;
import java.util.HashMap;
import java.util.Map;

/**
 * User: windonly
 * Date: 10-12-20 下午6:12
 */
public class Category {
    public static Map<String, CategoryDO> cache = null;
    private final static String CATEGORY_PATH = "/home/suoni/bp/services/category";
    private static boolean init = false;


    public static void init() {
        if (!init) {
            synchronized (Category.class) {
                if (!init) {
                    File cat = new File(CATEGORY_PATH);
                    if (cat.exists()) {
                        cache = CategoryLoadService.loadCategory(CATEGORY_PATH);
                    }
                    init = true;
                }
            }
        }
    }


    public static String get(String catId) {
        init();
        if (cache == null) {
            return getFromSimpleCache(catId);
        }
        if (cache.containsKey(catId))
            return cache.get(catId).getName();
        return catId;
    }

    private static String getFromSimpleCache(String catId) {
        if (simpleCache.containsKey(catId))
            return simpleCache.get(catId);
        return catId;
    }

    public static CategoryDO getCategory(String catId) {
        init();
        if (cache.containsKey(catId))
            return cache.get(catId);
        return null;
    }

    public static String getCategoryName(String catId) {
        init();
        if (cache.containsKey(catId))
            return cache.get(catId).getName();
        return catId;
    }

    public static Map<String, String> simpleCache = new HashMap<String, String>();
    private static String[] CATEGORY = new String[]{"11", "电脑硬件/显示器/电脑周边", "1101", "笔记本电脑",
            "1201", "MP3/MP4/iPod/录音笔", "14", "数码相机/摄像机/摄影器材", "1410", "内存卡/U盘/移动存储",
            "1512", "手机", "16", "女装/女士精品", "1625", "女士内衣/男士内衣/家居服", "1705", "饰品/流行首饰/时尚饰品",
            "1801", "美容护肤/美体/精油", "20", "电玩/配件/游戏/攻略", "21", "居家日用/收纳/礼品",
            "2128", "家装饰品/窗帘/地毯", "23", "古董/邮币/字画/收藏", "25", "玩具/娃娃/模型/动漫/桌游",
            "26", "汽车/用品/配件/改装/摩托", "27", "装潢/灯具/五金/安防/卫浴", "28", "ZIPPO/瑞士军刀/眼镜",
            "2813", "成人用品/避孕/计生用品", "29", "宠物/宠物食品及用品", "30", "男装", "3009", "男鞋",
            "33", "书籍/杂志/报纸", "34", "音乐/影视/明星/音像", "35", "奶粉/辅食/营养品", "40", "腾讯QQ专区",
            "50002766", "零食/坚果/茶叶/特产", "50002768", "个人护理/保健/按摩器材",
            "50003754", "网店装修/物流快递/图片存储", "50004958", "移动/联通/电信充值中心",
            "50005700", "品牌手表/流行手表", "50005998", "益智玩具/早教/童车床/出行", "50006842", "箱包皮具/热销女包/男包",
            "50006843", "女鞋", "50007216", "鲜花速递/花卉仿真/绿植园艺", "50007218", "办公设备/耗材/相关服务",
            "50008075", "演出/吃喝玩乐折扣券", "50008090", "3C数码配件市场", "50008097", "家用电器/hifi音响/耳机",
            "50008163", "床上用品/靠垫/毛巾/布艺", "50008164", "家具/家具定制/宜家代购", "50008165", "童装/童鞋/孕妇装",
            "50008168", "网络服务/电脑软件", "50008171", "珠宝/翡翠/钻石/黄金", "50008825", "保健品/滋补品",
            "50008907", "手机号码/套餐/增值业务", "50010387", "(待删除)", "50010388", "运动鞋", "50010404", "服饰配件/皮带/帽子/围巾",
            "50010728", "运动/瑜伽/健身/球迷用品", "50010788", "彩妆/香水/美发/工具", "50011150", "其它", "50011231", "爱菱后台护肤品",
            "50011232", "爱菱后台护肤品", "50011233", "爱菱后台家具", "50011235", "虚拟宝贝特征设置校验", "50011397", "珠宝/钻石/翡翠/黄金",
            "50011665", "网游装备/游戏币/帐号/代练", "50011699", "运动服/运动包/颈环配件", "50011740", "流行男鞋", "50011768", "预发布测试不要用",
            "50011769", "预发布测试不要用", "50011821", "天雷测试专用（不要删除）", "50011949", "酒店客栈/景点门票/度假旅游",
            "50011963", "沈利清数据迁移测试类目", "50011972", "影音电器", "50012009", "1", "50012029", "运动鞋new", "50012065",
            "沈利清测试", "50012066", "bvbvbv", "50012081", "国货精品手机", "50012082", "厨房电器", "50012100", "生活电器",
            "50012164", "闪存卡/U盘/存储/移动硬盘", "50012206", "BC整合临时类目", "50012422", "亲子装1", "50012472", "保健食品",
            "50012769", "零食", "50012788", "国货精品视听", "50012790", "国货精品视听", "50012794", "华丹萍测试类目", "50012979",
            "服饰", "50013698", "test", "50013793", "测试NEW", "50013797", "测试", "50013802", "男装特色市场", "50013812", "类目测试新",
            "50013816", "测试类目", "50013819", "新类目测试", "50013864", "饰品/流行首饰/时尚饰品新", "50013886", "户外/登山/野营/旅行用品",
            "50014435", "世博会", "50014436", "世博会", "50014441", "世博会", "50014442", "世博会特许商品", "50014476", "111", "50014811",
            "网店/网络服务/个性定制/软件", "50014812", "尿片/洗护/喂哺等用品", "50015815", "婴童/青少年家具", "50016348", "日化/清洁/护理",
            "50016349", "厨房/餐饮用具", "50016350", "保险", "50016422", "滋补/生鲜/速食/订餐", "50016768", "汽车其他", "50016891",
            "网游垂直市场根类目", "50017133", "MP3/MP4/移动电视/录音笔", "50017300", "乐器/吉他/钢琴/配件", "50017633",
            "123", "50017637", "甫嵩-母婴-益智玩具", "50017638", "婴儿健身器/健身架", "50017640", "丁家族谱", "50017641",
            "轻音后台一级类目", "50017642", "2", "50017645", "关安一级类目A", "50017646", "子晗", "50017647", "子晗的儿子",
            "50017648", "子晗1", "50017652", "TP服务商大类", "50017654", "关安一级类目B", "50017670", "曾爷爷",
            "50017673", "西装", "50017674", "君集 类目建立", "50017700", "夹克", "50017701", "电脑（一级类目）",
            "50017706", "45", "50017708", "男装（一级类目）", "50017709", "男装（一级类目）",
            "50017759", "电视", "50017760", "电视", "50017908", "彩票", "50018004", "电子词典/电纸书/文化用品", "50018104", "留下",
            "50018105", "留下", "50018106", "留是下", "50018107", "留是下", "50018155", "3654", "50018222", "台式机/一体机/服务器",
            "50018252", "电子票务凭证", "50018260", "涉圭书籍类目", "50018261", "涉圭书籍类目", "50018264", "网络设备/网络相关",
            "50018320", "测试", "50018719", "进口零食馆", "50018865", "测试公共属性（请勿用）", "50018902", "公共属性类目（测试用）",
            "50019230", "公共属性类目 测试勿动", "50019231", "类目测试110", "50019245", "手机(测试)", "50019253", "手机（测试）",
            "50019379", "合作商家", "50019478", "平安养老少儿险", "50019681", "垂直市场", "50019685", "垂直市场（测试）",
            "50019780", "平板电脑/MID", "50020120", "轨道", "50020179", "测试使用请及时屏蔽", "50020251", "测试用", "50020261",
            "11", "6666666", "美容护肤/美体/精油", "7777777", "演出/旅游/吃喝玩乐折扣券", "99", "网络游戏点卡",
            "50020275", "传统滋补品/其他保健营养品", "50020276", "品牌保健品"
    };

    static {
        for (int i = 0; i < CATEGORY.length; i = i + 2) {
            simpleCache.put(CATEGORY[i], CATEGORY[i + 1]);
        }
    }

    public static void main(String[] args) {
        System.out.println(get("1512"));
    }
}
